programming/java/code/tutorial/basic/interfaces.org
#+title: Interfaces
#+options: num:nil ^:nil creator:nil author:nil timestamp:nil

# 12

* =interfaces/FindDups.java=

#+BEGIN_SRC java -n :bangle FindDups.java :padline no
import java.util.HashSet;
import java.util.Set;

public class FindDups {
  public static void main(String[] args) {
    Set<String> s = new HashSet<String>();
    for (String a : args) s.add(a);
    System.out.println(s.size() + " distinct words: " + s);
  }
}
#+END_SRC

* =interfaces/FindDups2.java=

#+BEGIN_SRC java -n :bangle FindDups2.java :padline no
import java.util.HashSet;
import java.util.Set;

public class FindDups2 {
  public static void main(String[] args) {
    Set<String> uniques = new HashSet<String>();
    Set<String> dups = new HashSet<String>();

    for (String a : args) if (!uniques.add(a)) dups.add(a);

    // Destructive set-difference
    uniques.removeAll(dups);

    System.out.println("Unique words:    " + uniques);
    System.out.println("Duplicate words: " + dups);
  }
}
#+END_SRC

* =interfaces/Shuffle.java=

#+BEGIN_SRC java -n :bangle Shuffle.java :padline no
import java.util.Arrays;
import java.util.Collections;
import java.util.List;

public class Shuffle {
  public static void main(String[] args) {
    List<String> list = Arrays.asList(args);
    Collections.shuffle(list);
    System.out.println(list);
  }
}
#+END_SRC

