programming/java/code/tutorial/basic/interfaces.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Interfaces</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Interfaces</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5697512"><code>interfaces/FindDups.java</code></a></li>
<li><a href="#org18e548b"><code>interfaces/FindDups2.java</code></a></li>
<li><a href="#org45f92c3"><code>interfaces/Shuffle.java</code></a></li>
<li><a href="#org8e9fffa"><code>interfaces/Deal.java</code></a></li>
<li><a href="#org0520edf"><code>interfaces/Freq.java</code></a></li>
<li><a href="#org3bea9e3"><code>interfaces/Anagrams.java</code></a></li>
<li><a href="#orgc193193"><code>interfaces/Name.java</code></a></li>
<li><a href="#orgdc2ad3e"><code>interfaces/ArrayDequeSample.java</code></a></li>
<li><a href="#orgd0f3a29"><code>interfaces/NameSort.java</code></a></li>
<li><a href="#org964cc4c"><code>interfaces/ListTrim.java</code></a></li>
<li><a href="#orgd874583"><code>interfaces/OysterMonths.java</code></a></li>
<li><a href="#org1059930"><code>interfaces/Ran.java</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-org5697512" class="outline-2">
<h2 id="org5697512"><code>interfaces/FindDups.java</code></h2>
<div class="outline-text-2" id="text-org5697512">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">HashSet</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Set</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">FindDups</span> {
<span class="linenr"> 5: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 6: </span>    <span style="color: #0072b2; font-weight: bold;">Set</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>&gt; <span style="color: #e69f00; font-weight: bold;">s</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">HashSet</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>&gt;();
<span class="linenr"> 7: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">a</span> : args) s.add(a);
<span class="linenr"> 8: </span>    System.out.println(s.size() + <span style="color: #848ea9;">" distinct words: "</span> + s);
<span class="linenr"> 9: </span>  }
<span class="linenr">10: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org18e548b" class="outline-2">
<h2 id="org18e548b"><code>interfaces/FindDups2.java</code></h2>
<div class="outline-text-2" id="text-org18e548b">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">HashSet</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Set</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">FindDups2</span> {
<span class="linenr"> 5: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 6: </span>    <span style="color: #0072b2; font-weight: bold;">Set</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>&gt; <span style="color: #e69f00; font-weight: bold;">uniques</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">HashSet</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>&gt;();
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">Set</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>&gt; <span style="color: #e69f00; font-weight: bold;">dups</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">HashSet</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>&gt;();
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">a</span> : args) <span style="color: #56b4e9; font-weight: bold;">if</span> (!uniques.add(a)) dups.add(a);
<span class="linenr">10: </span>
<span class="linenr">11: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Destructive set-difference</span>
<span class="linenr">12: </span>    uniques.removeAll(dups);
<span class="linenr">13: </span>
<span class="linenr">14: </span>    System.out.println(<span style="color: #848ea9;">"Unique words:    "</span> + uniques);
<span class="linenr">15: </span>    System.out.println(<span style="color: #848ea9;">"Duplicate words: "</span> + dups);
<span class="linenr">16: </span>  }
<span class="linenr">17: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org45f92c3" class="outline-2">
<h2 id="org45f92c3"><code>interfaces/Shuffle.java</code></h2>
<div class="outline-text-2" id="text-org45f92c3">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Arrays</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Collections</span>;
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">List</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Shuffle</span> {
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">List</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>&gt; <span style="color: #e69f00; font-weight: bold;">list</span> = Arrays.asList(args);
<span class="linenr"> 8: </span>    Collections.shuffle(list);
<span class="linenr"> 9: </span>    System.out.println(list);
<span class="linenr">10: </span>  }
<span class="linenr">11: </span>}
</pre>
</div>
</div>
</div>
