programming/java/code/tutorial/basic/interfaces.org
* =interfaces/Name.java=

#+BEGIN_SRC java -n :bangle Name.java :padline no
public class Name implements Comparable<Name> {
  private final String firstName;
  private final String lastName;

  public Name(String firstName, String lastName) {
    if (firstName == null || lastName == null) {
      throw new NullPointerException();
    }
    this.firstName = firstName;
    this.lastName = lastName;
  }

  public String firstName() {
    return firstName;
  }

  public String lastName() {
    return lastName;
  }

  public boolean equals(Object o) {
    if (!(o instanceof Name)) {
      return false;
    }
    Name n = (Name) o;
    return n.firstName.equals(firstName) && n.lastName.equals(lastName);
  }

  public int hashCode() {
    return 31 * firstName.hashCode() + lastName.hashCode();
  }

  public String toString() {
    return firstName + " " + lastName;
  }

  public int compareTo(Name n) {
    int lastCmp = lastName.compareTo(n.lastName);
    return (lastCmp != 0 ? lastCmp : firstName.compareTo(n.firstName));
  }
}
#+END_SRC

* =interfaces/ArrayDequeSample.java=

#+BEGIN_SRC java -n :bangle ArrayDequeSample.java :padline no
/** ArrayDequeSample.java creates and prints the contents of an ArrayDeque. */
import java.util.ArrayDeque;
import java.util.Iterator;

public class ArrayDequeSample {
  public static void main(String[] args) {
    ArrayDeque<String> aDeque = new ArrayDeque<>();

    aDeque.addFirst("tea");
    aDeque.addFirst("milk");
    aDeque.addFirst("coffee");
    aDeque.addLast("sugar");

    /* Iterate through elements in an ArrayDeque instance */
    for (Iterator<String> itr = aDeque.iterator(); itr.hasNext(); ) {
      System.out.println(itr.next());
    }
    System.out.println();

    aDeque.addFirst("juice");
    aDeque.addLast("honey");

    System.out.println("First Element : " + aDeque.getFirst());
    System.out.println("Last Element : " + aDeque.getLast());

    /* Removal of the Deque Elements */
    System.out.println("First Element(Removed):" + aDeque.removeFirst());
    System.out.println("Last Element Removed:" + aDeque.removeLast());

    System.out.println("%nPopped Element : " + aDeque.pop());
    System.out.println("%n Size of Array Deque: " + aDeque.size());
  }
}
#+END_SRC

