programming/java/code/tutorial/basic/interfaces.html

<div id="outline-container-orgc193193" class="outline-2">
<h2 id="orgc193193"><code>interfaces/Name.java</code></h2>
<div class="outline-text-2" id="text-orgc193193">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Name</span> <span style="color: #56b4e9; font-weight: bold;">implements</span> <span style="color: #0072b2; font-weight: bold;">Comparable</span>&lt;<span style="color: #0072b2; font-weight: bold;">Name</span>&gt; {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #56b4e9; font-weight: bold;">final</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">firstName</span>;
<span class="linenr"> 3: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #56b4e9; font-weight: bold;">final</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">lastName</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #d55e00;">Name</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">firstName</span>, <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">lastName</span>) {
<span class="linenr"> 6: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> (firstName == <span style="color: #d55e00; font-weight: bold;">null</span> || lastName == <span style="color: #d55e00; font-weight: bold;">null</span>) {
<span class="linenr"> 7: </span>      <span style="color: #56b4e9; font-weight: bold;">throw</span> <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">NullPointerException</span>();
<span class="linenr"> 8: </span>    }
<span class="linenr"> 9: </span>    <span style="color: #56b4e9; font-weight: bold;">this</span>.firstName = firstName;
<span class="linenr">10: </span>    <span style="color: #56b4e9; font-weight: bold;">this</span>.lastName = lastName;
<span class="linenr">11: </span>  }
<span class="linenr">12: </span>
<span class="linenr">13: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">firstName</span>() {
<span class="linenr">14: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> firstName;
<span class="linenr">15: </span>  }
<span class="linenr">16: </span>
<span class="linenr">17: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">lastName</span>() {
<span class="linenr">18: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> lastName;
<span class="linenr">19: </span>  }
<span class="linenr">20: </span>
<span class="linenr">21: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">boolean</span> <span style="color: #d55e00;">equals</span>(<span style="color: #0072b2; font-weight: bold;">Object</span> <span style="color: #e69f00; font-weight: bold;">o</span>) {
<span class="linenr">22: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> (!(o <span style="color: #56b4e9; font-weight: bold;">instanceof</span> Name)) {
<span class="linenr">23: </span>      <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #d55e00; font-weight: bold;">false</span>;
<span class="linenr">24: </span>    }
<span class="linenr">25: </span>    <span style="color: #0072b2; font-weight: bold;">Name</span> <span style="color: #e69f00; font-weight: bold;">n</span> = (<span style="color: #0072b2; font-weight: bold;">Name</span>) o;
<span class="linenr">26: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> n.firstName.equals(firstName) &amp;&amp; n.lastName.equals(lastName);
<span class="linenr">27: </span>  }
<span class="linenr">28: </span>
<span class="linenr">29: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">hashCode</span>() {
<span class="linenr">30: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> 31 * firstName.hashCode() + lastName.hashCode();
<span class="linenr">31: </span>  }
<span class="linenr">32: </span>
<span class="linenr">33: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">toString</span>() {
<span class="linenr">34: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> firstName + <span style="color: #848ea9;">" "</span> + lastName;
<span class="linenr">35: </span>  }
<span class="linenr">36: </span>
<span class="linenr">37: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">compareTo</span>(<span style="color: #0072b2; font-weight: bold;">Name</span> <span style="color: #e69f00; font-weight: bold;">n</span>) {
<span class="linenr">38: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">lastCmp</span> = lastName.compareTo(n.lastName);
<span class="linenr">39: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> (lastCmp != 0 ? lastCmp : firstName.compareTo(n.firstName));
<span class="linenr">40: </span>  }
<span class="linenr">41: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc2ad3e" class="outline-2">
<h2 id="orgdc2ad3e"><code>interfaces/ArrayDequeSample.java</code></h2>
<div class="outline-text-2" id="text-orgdc2ad3e">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #848ea9;">/** ArrayDequeSample.java creates and prints the contents of an ArrayDeque. */</span>
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">ArrayDeque</span>;
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Iterator</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ArrayDequeSample</span> {
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">ArrayDeque</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>&gt; <span style="color: #e69f00; font-weight: bold;">aDeque</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">ArrayDeque</span>&lt;&gt;();
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>    aDeque.addFirst(<span style="color: #848ea9;">"tea"</span>);
<span class="linenr">10: </span>    aDeque.addFirst(<span style="color: #848ea9;">"milk"</span>);
<span class="linenr">11: </span>    aDeque.addFirst(<span style="color: #848ea9;">"coffee"</span>);
<span class="linenr">12: </span>    aDeque.addLast(<span style="color: #848ea9;">"sugar"</span>);
<span class="linenr">13: </span>
<span class="linenr">14: </span>    <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">Iterate through elements in an ArrayDeque instance */</span>
<span class="linenr">15: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">Iterator</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>&gt; <span style="color: #e69f00; font-weight: bold;">itr</span> = aDeque.iterator(); itr.hasNext(); ) {
<span class="linenr">16: </span>      System.out.println(itr.next());
<span class="linenr">17: </span>    }
<span class="linenr">18: </span>    System.out.println();
<span class="linenr">19: </span>
<span class="linenr">20: </span>    aDeque.addFirst(<span style="color: #848ea9;">"juice"</span>);
<span class="linenr">21: </span>    aDeque.addLast(<span style="color: #848ea9;">"honey"</span>);
<span class="linenr">22: </span>
<span class="linenr">23: </span>    System.out.println(<span style="color: #848ea9;">"First Element : "</span> + aDeque.getFirst());
<span class="linenr">24: </span>    System.out.println(<span style="color: #848ea9;">"Last Element : "</span> + aDeque.getLast());
<span class="linenr">25: </span>
<span class="linenr">26: </span>    <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">Removal of the Deque Elements */</span>
<span class="linenr">27: </span>    System.out.println(<span style="color: #848ea9;">"First Element(Removed):"</span> + aDeque.removeFirst());
<span class="linenr">28: </span>    System.out.println(<span style="color: #848ea9;">"Last Element Removed:"</span> + aDeque.removeLast());
<span class="linenr">29: </span>
<span class="linenr">30: </span>    System.out.println(<span style="color: #848ea9;">"%nPopped Element : "</span> + aDeque.pop());
<span class="linenr">31: </span>    System.out.println(<span style="color: #848ea9;">"%n Size of Array Deque: "</span> + aDeque.size());
<span class="linenr">32: </span>  }
<span class="linenr">33: </span>}
</pre>
</div>
</div>
</div>
