programming/java/code/tutorial/basic/interfaces.html

<div id="outline-container-org1059930" class="outline-2">
<h2 id="org1059930"><code>interfaces/Ran.java</code></h2>
<div class="outline-text-2" id="text-org1059930">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Arrays</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Collections</span>;
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">List</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Ran</span> {
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Get and shuffle the list of arguments</span>
<span class="linenr">10: </span>    <span style="color: #0072b2; font-weight: bold;">List</span>&lt;<span style="color: #0072b2; font-weight: bold;">String</span>&gt; <span style="color: #e69f00; font-weight: bold;">argList</span> = Arrays.asList(args);
<span class="linenr">11: </span>    Collections.shuffle(argList);
<span class="linenr">12: </span>
<span class="linenr">13: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Print out the elements using JDK 8 Streams</span>
<span class="linenr">14: </span>    argList.stream().forEach(e -&gt; System.out.format(<span style="color: #848ea9;">"%s "</span>, e));
<span class="linenr">15: </span>
<span class="linenr">16: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Print out the elements using for-each</span>
<span class="linenr">17: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">arg</span> : argList) {
<span class="linenr">18: </span>      System.out.format(<span style="color: #848ea9;">"%s "</span>, arg);
<span class="linenr">19: </span>    }
<span class="linenr">20: </span>
<span class="linenr">21: </span>    System.out.println();
<span class="linenr">22: </span>  }
<span class="linenr">23: </span>}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
